#include <iostream>
#include <string>
#include <time.h>
#include <cstdlib>


using namespace std;

int main()
{
	short k; 
	string s;
	srand(time(NULL)); /*подключаем srand, чтобы каждый раз выводило новую строку*/
	setlocale(LC_ALL, "Russian");
	cin >> k; /* вводим количество символов*/
	string* arry= new string[k]; /* создаем динамический массив*/
	for ( int j = 0; j < k; j++)
		arry[j] = "0"; 
	/*далее создаем массив с элементами, которые будет брать дл€ нового массива*/
	string arr[] = {"а", "б", "в", "г", "д", "е", "Є", "ж", "з", "и", "й", "к", "л", "м", "н", "о", "п", "р", "с", "т", "у", "ф", "х", "ц", "ч", "ш", "щ", "ъ", "ы", "ь", "э", "ю", "€", "ј", "Ѕ", "¬", "√", "ƒ", "≈", "®", "∆", "«", "»", "…", " ", "Ћ", "ћ", "Ќ", "ќ", "ѕ", "–", "—", "“", "”", "‘", "’", "÷", "„", "Ў", "ў", "Џ", "џ", "№", "Ё", "ё", "я", "0", "1", "2", "3", "4", "5", "6", "7", "8", "9"};
	for (int i = 0; i < 76; i++) 
	{
		for (int j = 0; j < k; j++)
		{
			string a = arr[rand()%76]; /*находим с помощью функции rand рандомный элемент с массива*/
			arry[j] = a; /*вносим его в новый массив, из которого надо сделать строку*/
		}
	}
	while (s.length()<101) /*создаем цикл дл€ того, чтобы задать параметр строки*/
	{
		for (int j = 0; j < k; j++)
		{
			string d =arry[rand()%k]; /*так же из нового массива берем рандомный элемент*/
			s += d; /*добавл€ем его в строку*/
		}
	}
	cout << s << endl; /*выводим строку*/
	return 0;
}
//ѕримеры строки : гн9Єу“џ“уЄƒянгхЌч9Ёчу€ƒнџ9®9ƒ∆ахЌЌ€∆мџ«жгЄя‘«нуџЌж9‘«Ќяг…жџ∆жян€Єгхчнхцу∆мжЌЌƒ“г‘нц“9жаџ∆Ќ®Ќџ∆у€ƒЄ««уЁ‘ц‘ЌЄџ;
//ц№п„э пащЁЌ5рёраамЁцЁ„к7„исасщ 6««аёё„«Ќ7ёрЁипЌ«гмщ7пЁ«ё«ќ6сЌмсмикцрём5ёЌ цса„эсёгсп ща®5®№ «щаюё®ќщюё7цќ«щ№
