#include <iostream>
#include <string>

using namespace std;

int main()
{
	string s1, s2, s3, s4; /*s1, s2, s3, s4 - примеры правильных скобочных последовательностей*/
	int k, n=0;
	cin >> k;/* ввод переменной*/
	k = k * 2 + 20;
	while (n < k/2) /*первый пример. находим половину количества скобок*/
	{
		s1 += "(";
			n++; /*сначала добавляем скобку "("*/
	}
	n = 0;
	while (n < k/2) /*так же через цикл добавляем скобку ")" до к/2*/
	{
		s1 += ")";
		n++; 
	}
	n = 0;
	s2 += "("; /*второй пример. ставим "("*/
	int a = k - 2;
	while (n < a)
	{
		s2 += "()"; /*далее мы заполняем внутри скобок парами "()". их количество к-2*/
		n++;
	}
	s2 += ")"; /*ставим ")"*/
	n = 0;
	if (a % 2==0) /*третий и четвертый пример. если найденное а делится на 2, то можно сделать ещё два случая*/
	{
		s3 += "("; /*когда внутри скобак стоят пары по 2 "(" и ")"*/
		s4 += "(("; /*когда внутри двойных скобак стоят пары "()"*/
		while (n < a / 2)
		{
			s3 += "(())"; /*количество этих пар будет равно а/2, поэтому создаем цикл до а/2*/
			n++;
		}
		n = 0;
		while (n < a / 2)
		{
			s4 += "()"; /*с этим случаем аналогично */
			n++;
		}
		s3 += ")";
		s4 += "))";
	}
	cout << s1 <<" "<< s2 <<" "<< s3 <<" "<< s4 << endl; /*выводим примеры*/
	return 0;
}
//Примеры: ((((((((((((((((((((((((((((((((((((())))))))))))))))))))))))))))))))))))) 
//(()()()()()()()()()()()()()()()()()()()()()()()()()()()()()()()()()()()()()()()()()()()()()()()()()()()()()()()()()()()()()()()()()()()()()()()())
//((())(())(())(())(())(())(())(())(())(())(())(())(())(())(())(())(())(())(())(())(())(())(())(())(())(())(())(())(())(())(())(())(())(())(())(())) 
//((()()()()()()()()()()()()()()()()()()()()()()()()()()()()()()()()()()()()))